#include "i2c.h"
#include "s2.h"

/*********************************************************************************************
������:      delay_s2_ms
����:        s2�Ӱ���ʱ����
��ڲ���:    count
���ڲ���:    ��
����ֵ��     ��
���ߣ�       ZZZ
����:        2023/4/1
**********************************************************************************************/
void delay_s2_ms(uint16_t count)
{
	uint16_t i;
	uint32_t decount;
	for(i=0;i<count;i++)
	{
		for(decount=0;decount<50000;decount++)
		{
		}	
	}	 
}

/*********************************************************************************************
������:      s2_init_bh1750
����:        ��ʼ��bh1759
��ڲ���:    i2c_periph:i2c��   i2c_addr:i2c��ַ
���ڲ���:    ��
����ֵ��     ��
���ߣ�       ZZZ
����:        2023/4/1
**********************************************************************************************/
void s2_init_bh1750(uint32_t i2c_periph,uint8_t i2c_addr)
{
     i2c_cmd_write(i2c_periph,i2c_addr,0x01);
}

/*********************************************************************************************************
������:     s2_init
��ڲ���:   i2c��ʼ��ַ address 
���ڲ���:   �� 
����ֵ:     i2c_addr_def����ṹ��
����:       zzz
����:       2023/4/1
��������:   �õ�s2 i2c��ַ,��������������ṹ��flagֵΪ0,���������ʼ��оƬ�ýṹ��flagֵΪ1
**********************************************************************************************************/
i2c_addr_def s2_init(uint8_t address)
{
	i2c_addr_def e_addess;   
	e_addess.flag = 0; 
	if(address == S1_ADDRESS_S2)
	{
		e_addess = get_board_address(S1_ADDRESS_S2);  
		if(e_addess.flag != 1)	
		{
			e_addess = get_board_address(S2_ADDRESS_S2);	
		}			
		if(e_addess.flag)	
		{
			s2_init_bh1750(e_addess.periph,e_addess.addr);
		}					 
	}

	return e_addess;		 
}
/*********************************************************************************************
������:      s2_read_bh1750_value
����:        ��ȡ���ն�  
��ڲ���:    2c_periph:i2c��   i2c_addr:i2c��ַ
���ڲ���:    ��
����ֵ��     float ss������ֵ
���ߣ�       ZZZ
����:        2023/4/1
��������:    ��ȡbh1750�Ĺ���ǿ��ֵ
**********************************************************************************************/
float s2_read_bh1750_value(uint32_t i2c_periph,uint8_t i2c_addr)
{	
	uint16_t tmp;
	uint8_t ss_value[2];
	float ss;

	i2c_cmd_write(i2c_periph,i2c_addr,0x01);
	i2c_cmd_write(i2c_periph,i2c_addr,0x10);
	delay_s2_ms(200);
	i2c_direct_read(i2c_periph,i2c_addr,ss_value,2);
	tmp = (ss_value[0]<<8) + ss_value[1];
	ss = (float)tmp*10/12;

	return ss;
}



